src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a69f874-6aec-457e-8ade-4fb7762659ab">
    <name>проф_ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048b6482-1229-4a9b-bde1-a32f6b28cf3d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c978a924-8a72-4669-a86a-a1e5e31fd099">
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39aa0f15-c415-409c-a64b-12fd0ee1e845">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17a02a98-8e64-4576-9b3b-4cfc58e2d8cf">
  <name>торо_ИнтеграцияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="e9a88077-61c6-452d-90f2-47d4f24e77da">
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="4736aca1-8591-4fd1-81ac-2e197db4fc05">
    <name>ДокументТОИР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e9f3faae-f405-4f24-9277-030e531fcfbb">
    <name>ДокументЕРП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/AccumulationRegisters/ЗаказыНаВнутреннееПотребление/ЗаказыНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8e3cf62-a29a-4eb6-a0cd-e005b9df98cc">
  <name>ЗаказыНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="3b3e1e2b-83d4-4335-a03f-8801607a9128">
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="c4f0e75b-3aa7-4acb-9b3b-e7fc3b1c66e2">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="92ba211b-e615-40a8-aaf1-faae851399f1">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="581e19d8-10ab-490b-8ae2-4316b7e81b6c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="897933ed-4417-494e-a54b-4e8adf9b7794">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Enums/проф_ХозяйственнаяОперация/проф_ХозяйственнаяОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="85d9c202-c830-4b20-b1d3-c80f4675f995">
  <name>проф_ХозяйственнаяОперация</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="311163c4-23a7-4c14-be3f-1d4bf4634f6a">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fe871ca1-2b53-415b-afd7-df7a45c2dc7f">
    <name>ПередачаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="41f4f6c1-a9c4-443f-97b5-62a83d5a9725">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="feae67ed-6dc9-49c5-a307-3811be01be0e">
    <name>проф_ЗаказДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aaee8848-18c0-4459-8461-a6f8cde70246">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="873a5588-15b7-419a-ac32-2cfcdd64f86d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a9600285-8615-4521-86d8-2bca0bfd8ec8">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd34090-ac80-44d9-b29a-f37fc28b0c69">
    <name>торо_СтатусУтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f24b0b4d-40fc-46e5-9a5c-1c14fd1080ca">
    <name>проф_ТоварыИсточника</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/проф_Назначения/проф_Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9ffd7683-e584-474a-b265-31df63ffc5a9">
  <name>проф_Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="710428d6-cf35-40d5-ba2f-b8358d3e48d1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ac1cff61-ca3f-43ba-98e8-a73eede81b43">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe2cc228-8fb0-4209-9c64-f8d7349cf1a0">
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d873557d-2cd2-49b8-b9b9-ba74907ab271">
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfcd486f-ce81-4d09-95fb-ac1dc450ccc2">
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0005b69f-a259-4c75-ac02-65ccc9e14578">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2635dfe1-50d3-44bc-b327-52eaf52f459d">
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b2e17e5-1e7a-4d58-a2ee-2b5810f1fb86">
    <name>ТипОбъектаНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30556ed4-3c87-4803-9f56-54b8640f13fa">
    <name>CostCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d17a6c84-8090-4a0b-be0c-41c4f0e1e94b">
    <name>ИДЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы	

&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("проф_ИнвентарныйУчет", Новый ОписаниеТипов("Булево"), 
		"Объект.Товары", "Инвентарный учет"));
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	
	//++ Проф-ИТ, issue_26, Ровенский О.В., 24.07.2023
	НовыйЭлемент = Элементы.Добавить("НаправлениеДеятельности", Тип("ПолеФормы"), Элементы.ШапкаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.проф_НаправлениеДеятельности";	
	//-- Проф-ИТ, issue_26, Ровенский О.В., 24.07.2023
	
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	НовыйЭлемент = Элементы.Добавить("проф_ДокументОснование", Тип("ПолеФормы"), ЭтотОбъект);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.проф_ДокументОснование";
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Видимость = ЗначениеЗаполнено(Объект.проф_ДокументОснование);
	НовыйЭлемент.УстановитьДействие("Нажатие", "проф_ДокументОснованиеНажатие");
	Элементы.Переместить(НовыйЭлемент, Элементы.Шапка, Элементы.ДатаНомер);
	
	НовыйЭлемент  = Элементы.Добавить("ТоварыНазначение", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.проф_Назначение";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыУпаковкаЕдиницаИзмерения);
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	
	//++ Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	НовыйЭлемент = Элементы.Добавить("ХозяйственнаяОперация", Тип("ПолеФормы"), Элементы.ШапкаЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.проф_ХозяйственнаяОперация";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "проф_ХозяйственнаяОперацияПриИзменении");
	
	ТоварыКатегорииЭксплуатации = Элементы.Добавить("ТоварыКатегорииЭксплуатации", Тип("ПолеФормы"), Элементы.Товары);
	ТоварыКатегорииЭксплуатации.Вид = ВидПоляФормы.ПолеВвода;      
	ТоварыКатегорииЭксплуатации.ПутьКДанным = "Объект.Товары.проф_КатегорииЭксплуатации";
	ТоварыКатегорииЭксплуатации.УстановитьДействие("ПриИзменении", "проф_ТоварыКатегорииЭксплуатацииПриИзменении");
	
	//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023	
	ТоварыИнвентарныйНомер = Элементы.Добавить("ТоварыИнвентарныйНомер", Тип("ПолеФормы"), Элементы.Товары);
	ТоварыИнвентарныйНомер.Вид = ВидПоляФормы.ПолеФлажка;      
	ТоварыИнвентарныйНомер.ПутьКДанным = "Объект.Товары.проф_ИнвентарныйНомер";
	//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	
	ТоварыФизическоеЛицо = Элементы.Добавить("ТоварыФизическоеЛицо", Тип("ПолеФормы"), Элементы.Товары);
	ТоварыФизическоеЛицо.Вид = ВидПоляФормы.ПолеВвода;      
	ТоварыФизическоеЛицо.ПутьКДанным = "Объект.Товары.проф_ФизическоеЛицо";
	
	Если Не ЗначениеЗаполнено(Объект.проф_ХозяйственнаяОперация) 
		Или Объект.проф_ХозяйственнаяОперация = Перечисления.проф_ХозяйственнаяОперация.СписаниеТоваровПоТребованию Тогда 
		ТоварыКатегорииЭксплуатации.Видимость = Ложь;
		ТоварыИнвентарныйНомер.Видимость      = Ложь;
		ТоварыФизическоеЛицо.Видимость        = Ложь;	
	КонецЕсли;
	//-- Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	
	//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	проф_УстановитьУсловноеОформление();
	
	проф_ЗаполнитьТЧТоварыИнвентарныйУчет();
	//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	проф_ОбщегоНазначенияВызовСервера.УстановитьПараметрВыбораПодразделения(Элементы);
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

&НаКлиенте
Процедура проф_ПриОткрытииВместо(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	
	Если ЗначениеЗаполнено(ID) Тогда
		//++ Проф-ИТ, #183, Соловьев А.А., 15.09.2023
		//ПоказатьВопрос(Новый ОписаниеОповещения("ПривязатьСтрокиАктаКЗаказамВопрос", ЭтотОбъект), 
		//	НСтр("ru = 'Привязать строки к заказам на внутреннее потребление?'"), 
		//	РежимДиалогаВопрос.ДаНет);
		ПривязатьСтрокиАктаКЗаказамВопрос(КодВозвратаДиалога.Да, Неопределено);
		//-- Проф-ИТ, #183, Соловьев А.А., 15.09.2023	
	Иначе
			
		УстановитьДоступностьКнопокТоваров();
		СписокЗаказовСохраненный.ЗагрузитьЗначения(СписокЗаказов.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура проф_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)

	//++ Проф-ИТ, #303, Корнилов М.С., 15.09.2023
	проф_ЗаполнитьТЧТоварыИнвентарныйУчет();
	//-- Проф-ИТ, #303, Корнилов М.С., 15.09.2023
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура проф_ДокументОснованиеНажатие(Элемент, СтандартнаяОбработка)

	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	ПоказатьЗначение(, Объект.проф_ДокументОснование);
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПодобратьЗаказы")
Процедура проф_ПодобратьЗаказы()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ИнтеграцияДокументов.ДокументЕРП КАК Заказ
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ДокументЕРП ССЫЛКА Документ.ЗаказНаВнутреннееПотребление
	|	И торо_ИнтеграцияДокументов.ID В (&ID)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Вставка
	//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
	|	ДокументЗаказНаВнутреннееПотребление.проф_НаправлениеДеятельности КАК проф_НаправлениеДеятельности,
	//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
	#КонецВставки
	|	ЗаказыНаВнутреннееПотреблениеОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыНаВнутреннееПотреблениеОстатки.Характеристика КАК Характеристика,
	|	ЗаказыНаВнутреннееПотреблениеОстатки.Склад КАК Склад,
	|	ЗаказыНаВнутреннееПотреблениеОстатки.Серия КАК Серия,
	|	ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюОстаток КАК Количество,
	|	ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	|	ДокументЗаказНаВнутреннееПотребление.проф_Назначение КАК проф_Назначение,
	//-- Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	//++ Проф-ИТ, #316, Соловьев А.А., 31.10.2023
	|	ДокументЗаказНаВнутреннееПотребление.ДокументОснование КАК проф_ДокументОснование,
	//-- Проф-ИТ, #316, Соловьев А.А., 31.10.2023
	#КонецВставки
	|	ЗаказыНаВнутреннееПотреблениеОстатки.КодСтроки КАК КодСтроки
	|ИЗ
	|	РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки(
	|			,
	|			ЗаказНаВнутреннееПотребление В
	|				(ВЫБРАТЬ
	|					Заказы.Заказ
	|				ИЗ
	|					Заказы)) КАК ЗаказыНаВнутреннееПотреблениеОстатки
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ДокументЗаказНаВнутреннееПотребление
	|		ПО ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление = ДокументЗаказНаВнутреннееПотребление.Ссылка
	//-- Проф-ИТ, #27, Соловьев А.А., 28.08.2023
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление.ДатаОтгрузки";
	Запрос.УстановитьПараметр("ID", ID);
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'По выбранному ремонту/ремонтам не введены заказы на внутреннее потребление.'"));	
	Иначе
		Объект.ПотреблениеПоЗаказам = Истина;
		Заказы = РезЗапроса.Выгрузить();
		#Вставка
		//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
		Если Заказы.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(Объект, Заказы[0]);
			//++ Проф-ИТ, #316, Соловьев А.А., 31.10.2023
			Если ЗначениеЗаполнено(Объект.проф_ДокументОснование) Тогда 
				Элементы["проф_ДокументОснование"].Видимость = Истина;
			КонецЕсли;
			//-- Проф-ИТ, #316, Соловьев А.А., 31.10.2023
			проф_Назначение = Заказы[0].проф_Назначение;
		Иначе
			проф_Назначение = Справочники.проф_Назначения.ПустаяСсылка();
		КонецЕсли;
		//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
		#КонецВставки
		Заказы.Индексы.Добавить("Номенклатура, Характеристика, Серия");
		КопияТЧТовары = Объект.Товары.Выгрузить();
		СтрокиДляУдаления = Новый Массив;
		ЕстьПривязанные = Ложь;
		Для Каждого СтрокаТЧ Из КопияТЧТовары Цикл
			НайденныеЗаказы = Заказы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", 
			СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Серия));
			Если НайденныеЗаказы.Количество() = 1 Тогда
				ЕстьПривязанные = Истина;
				НайденнаяСтрока = НайденныеЗаказы[0];	
				СтрокаИсходнойТЧ = Объект.Товары[КопияТЧТовары.Индекс(СтрокаТЧ)];
				Если СтрокаИсходнойТЧ.Количество > НайденнаяСтрока.Количество Тогда  
					НоваяСтрокаТЧ = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаИсходнойТЧ);
					Количество = СтрокаИсходнойТЧ.Количество - НайденнаяСтрока.Количество; 
					НоваяСтрокаТЧ.Количество = Количество;
					НоваяСтрокаТЧ.КоличествоУпаковок = Количество;
					НоваяСтрокаТЧ.РасхождениеЗаказ = 1;	
					#Вставка
					//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
					НоваяСтрокаТЧ.проф_Назначение = НайденнаяСтрока.проф_Назначение;
					//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
					#КонецВставки
				КонецЕсли;
				СтрокаИсходнойТЧ.ЗаказНаВнутреннееПотребление = НайденнаяСтрока.ЗаказНаВнутреннееПотребление;
				СтрокаИсходнойТЧ.КодСтроки = НайденнаяСтрока.КодСтроки;
				СтрокаИсходнойТЧ.Количество = НайденнаяСтрока.Количество;
				СтрокаИсходнойТЧ.КоличествоУпаковок = НайденнаяСтрока.Количество;
				#Вставка
				//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
				СтрокаИсходнойТЧ.проф_Назначение = НайденнаяСтрока.проф_Назначение;
				//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
				#КонецВставки
			ИначеЕсли НайденныеЗаказы.Количество() > 0 Тогда 
				КоличествоВАкте = СтрокаТЧ.Количество;
				ЕстьПривязанные = Истина;
				Для Каждого Заказ Из НайденныеЗаказы Цикл 
					Если КоличествоВАкте <= 0 Тогда 
						Прервать;
					КонецЕсли;
					НоваяСтрокаТЧ = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТЧ);
					НоваяСтрокаТЧ.ЗаказНаВнутреннееПотребление = Заказ.ЗаказНаВнутреннееПотребление;
					НоваяСтрокаТЧ.КодСтроки = Заказ.КодСтроки;
					Количество = Мин(КоличествоВАкте, Заказ.Количество);
					#Вставка
					//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
					НоваяСтрокаТЧ.проф_Назначение = Заказ.проф_Назначение;
					//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
					#КонецВставки
					НоваяСтрокаТЧ.Количество = Количество;
					НоваяСтрокаТЧ.КоличествоУпаковок = Количество; 
					КоличествоВАкте = КоличествоВАкте - Количество;
				КонецЦикла;
				Если КоличествоВАкте > 0 Тогда 
					ИсходнаяСтрокаТЧ = Объект.Товары[КопияТЧТовары.Индекс(СтрокаТЧ)]; 
					ИсходнаяСтрокаТЧ.Количество = КоличествоВАкте;
					ИсходнаяСтрокаТЧ.КоличествоУпаковок = КоличествоВАкте;
					ИсходнаяСтрокаТЧ.РасхождениеЗаказ = 1;
				Иначе
					СтрокиДляУдаления.Добавить(Объект.Товары[КопияТЧТовары.Индекс(СтрокаТЧ)]);
				КонецЕсли;
			Иначе
				Объект.Товары[КопияТЧТовары.Индекс(СтрокаТЧ)].РасхождениеЗаказ = 1;
				#Вставка
				//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
				Объект.Товары[КопияТЧТовары.Индекс(СтрокаТЧ)].проф_Назначение = проф_Назначение;
				//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
				#КонецВставки
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из СтрокиДляУдаления Цикл 
			Объект.Товары.Удалить(Строка);
		КонецЦикла;

		Если НЕ ЕстьПривязанные Тогда 
			Объект.ПотреблениеПоЗаказам = Ложь;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось привязать строки к заказам на внутреннее потребление.'"));	
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура проф_ХозяйственнаяОперацияПриИзменении(Элемент)
	
	//++ Проф-ИТ, #183, Соловьев А.А., 21.09.2023
	ПередачаВЭксплуатацию = ПредопределенноеЗначение("Перечисление.проф_ХозяйственнаяОперация.ПередачаВЭксплуатацию");
	ЭтоПередачаВЭксплуатацию = (Объект.проф_ХозяйственнаяОперация = ПередачаВЭксплуатацию);
	//-- Проф-ИТ, #183, Соловьев А.А., 21.09.2023
	//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	Элементы["ТоварыКатегорииЭксплуатации"].Видимость = ЭтоПередачаВЭксплуатацию;
	Элементы["ТоварыИнвентарныйНомер"].Видимость      = ЭтоПередачаВЭксплуатацию;
	Элементы["ТоварыФизическоеЛицо"].Видимость        = ЭтоПередачаВЭксплуатацию;
	//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	
КонецПроцедуры

//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
&НаКлиенте
Процедура проф_ТоварыКатегорииЭксплуатацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ИнвентарныйУчет = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
		ТекущаяСтрока.проф_КатегорииЭксплуатации, "ИнвентарныйУчет");
		
	ТекущаяСтрока.проф_ИнвентарныйУчет = ИнвентарныйУчет;
	
	Если ИнвентарныйУчет = Ложь Тогда 
		ТекущаяСтрока.проф_ИнвентарныйНомер = "";	
	КонецЕсли;
	
КонецПроцедуры
//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
&НаСервере
Процедура проф_УстановитьУсловноеОформление()
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыИнвентарныйНомер.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.проф_ИнвентарныйУчет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<инвентарный номер не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыИнвентарныйНомер.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.проф_ИнвентарныйУчет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.проф_ИнвентарныйНомер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		
КонецПроцедуры

&НаСервере
Процедура проф_ЗаполнитьТЧТоварыИнвентарныйУчет()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутреннееПотреблениеТоваровТовары.НомерСтроки - 1 КАК ИндексСтроки
		|ИЗ
		|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_КатегорииЭксплуатации КАК Спр_КатегорииЭксплуатации
		|		ПО ВнутреннееПотреблениеТоваровТовары.проф_КатегорииЭксплуатации = Спр_КатегорииЭксплуатации.Ссылка
		|			И (Спр_КатегорииЭксплуатации.ИнвентарныйУчет = ИСТИНА)
		|ГДЕ
		|	ВнутреннееПотреблениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
	ВыборкаТовары = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл
		Объект.Товары[ВыборкаТовары.ИндексСтроки].проф_ИнвентарныйУчет = Истина;
	КонецЦикла;
	
КонецПроцедуры
//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023

#КонецОбласти
